# Project One: Climate Change - Earth Surface Temperature

In [1]:
#1. What’s the global average yearly temperature movements over the last 10 or 11 decades?
#a. Assumption: The global average yearly temperature has increased
#2. Is there a correlation between global population growth and temperature rise?
#3. If the temperature movements across the last 10 or 11 decades were different between the Northern and Southern hemisphere.
#4. Which are the top 10 countries that experienced the maximum average yearly temperature shifts?
#a. With the highest temperature rise and looking for any causes or any policies they have adopted.
#5. Which are the bottom 10 countries that had the least change in average yearly temperatures?
#6. Looking at Australia, what’re the changes in yearly temperature in the last 10 or 11 decades?
#7. Compare between Melbourne and Sydney, are there differences between the movements of average yearly temperature?

In [2]:
# Import relevant dependencies

import pandas as pd
import gmaps
import matplotlib.pyplot as plt
import scipy.stats as stats
from scipy.stats import linregress
import requests
import json
from pprint import pprint
import numpy as np

## Data Cleanup

In [3]:
#Clean up the CSV

# Read CSV & format the date variable & remove na
global_temp = pd.read_csv('GlobalLandTemperaturesByCountry 4.csv',parse_dates=["dt"], index_col="dt")
global_temp.dropna(inplace=True)

# Preview the DataFrame
global_temp.head()

            AverageTemperature  AverageTemperatureUncertainty Country
dt
1743-11-01               4.384                          2.294   Åland
1744-04-01               1.530                          4.680   Åland
1744-05-01               6.702                          1.789   Åland
1744-06-01              11.609                          1.577   Åland
1744-07-01              15.342                          1.410   Åland

In [4]:
# Retrieve the Year from the "dt" variable for later groupby process
global_temp["Year"] = global_temp.index.year

# Preview DataFrame
global_temp.head()

            AverageTemperature  AverageTemperatureUncertainty Country  Year
dt
1743-11-01               4.384                          2.294   Åland  1743
1744-04-01               1.530                          4.680   Åland  1744
1744-05-01               6.702                          1.789   Åland  1744
1744-06-01              11.609                          1.577   Åland  1744
1744-07-01              15.342                          1.410   Åland  1744

In [5]:
# Drop all data prior to 1913 & drop blanks

filtered_df = global_temp.loc[global_temp["Year"]>=1913]

filtered_df

            AverageTemperature  AverageTemperatureUncertainty   Country  Year
dt
1913-01-01              -2.742                          0.606     Åland  1913
1913-02-01              -0.599                          0.359     Åland  1913
1913-03-01               0.925                          0.276     Åland  1913
1913-04-01               3.138                          0.458     Åland  1913
1913-05-01               7.319                          0.486     Åland  1913
...                        ...                            ...       ...   ...
2013-04-01              21.142                          0.495  Zimbabwe  2013
2013-05-01              19.059                          1.022  Zimbabwe  2013
2013-06-01              17.613                          0.473  Zimbabwe  2013
2013-07-01              17.000                          0.453  Zimbabwe  2013
2013-08-01              19.759                          0.717  Zimbabwe  2013

[291501 rows x 4 columns]

In [6]:
# Groupby Year to create the global average yearly temperature DataFrame (1st question)

global_yearly = filtered_df.groupby("Year").agg({"AverageTemperature":"mean"})

global_yearly

      AverageTemperature
Year
1913           18.491490
1914           18.660602
1915           18.711240
1916           18.551877
1917           18.242554
...                  ...
2009           19.546385
2010           19.629806
2011           19.456040
2012           19.468744
2013           19.877007

[101 rows x 1 columns]

In [7]:
# Groupby Year & Country and calculate the average yearly temperature for each country in each year
# This DataFrame will be used as the main DataFrame for resolving later questions

country_yearly = filtered_df.groupby(["Year","Country"]).agg({"AverageTemperature":"mean"})

country_yearly

                     AverageTemperature
Year Country
1913 Afghanistan              13.859250
     Africa                   23.980583
     Albania                  12.352167
     Algeria                  23.079250
     American Samoa           26.115750
...                                 ...
2013 Western Sahara           23.744250
     Yemen                    28.129750
     Zambia                   21.196000
     Zimbabwe                 20.710750
     Åland                     6.229750

[24372 rows x 1 columns]

## Analysis

### 1. What’s the global average yearly temperature movements over the last 10 or 11 decades?
       a. Assumption: The global average yearly temperature has increased

In [8]:
# Global average yearly temperature movements over the last 10 decades

### 2. Is there a correlation between global population growth and temperature rise?

### 3. If the temperature movements across the last 10 or 11 decades were different between the Northern and Southern hemisphere.

### 4. Which are the top 10 countries that experienced the maximum average yearly temperature shifts?
        a. With the highest temperature rise and looking for any causes or any policies they have adopted.

### 5. Which are the bottom 10 countries that had the least change in average yearly temperatures?

### 6. Looking at Australia, what’re the changes in yearly temperature in the last 10 or 11 decades?

### 7. Compare between Melbourne and Sydney, are there differences between the movements of average yearly temperature?